homework-1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Homework 1</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" href="css/worg.css" type="text/css" media="screen" />
</head>
<body>
<div id="preamble" class="status">
<a href="index.html">Home</a> &nbsp; &nbsp;
          <!-- Plupper Button -->
          <!-- <div id="plupperButton" style="display: inline;"></div> -->
          <!-- End of Plupper Button Code -->
</div>
<div id="content">
<h1 class="title">Homework 1</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Task 1 (30 pts)</a></li>
<li><a href="#sec-2">Task 2 (10 pts)</a></li>
<li><a href="#sec-3">Task 3 (10 pts)</a></li>
<li><a href="#sec-4">Task 4 (50 pts) OR Task 5 (50 pts), below; complete both for extra credit (+50 pts)</a></li>
<li><a href="#sec-5">Task 5 (50 pts) OR Task 4 (50 pts), above; complete both for extra credit (+50 pts)</a></li>
<li><a href="#sec-6">Task 6 (Extra credit, +25 pts)</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Task 1 (30 pts)</h2>
<div class="outline-text-2" id="text-1">
<p>
This task tests your knowledge of Python programming. Refer to the
<a href="./python.html">Learning Python</a> notes. Write your code in a single file and upload it
to the Carmen dropbox.
</p>

<ol class="org-ol">
<li>Translate this code from a <code>for</code> loop into a <code>while</code> loop that does
the same thing.

<div class="org-src-container">

<pre class="src src-python"><span style="color: #004dd0; background-color: #ffffff;">for</span> i <span style="color: #004dd0; background-color: #ffffff;">in</span> <span style="color: #000000; background-color: #ffffff; font-weight: bold;">range</span>(1,100):
    <span style="color: #004dd0; background-color: #ffffff;">print</span> <span style="color: #670088; background-color: #ffffff; font-style: italic;">"i = "</span>, i
</pre>
</div>
</li>

<li>Translate this code from a <code>while</code> loop into a <code>for</code> loop that does
the same thing:

<div class="org-src-container">

<pre class="src src-python"><span style="color: #000000; background-color: #ffffff;">i</span> = 20
<span style="color: #004dd0; background-color: #ffffff;">while</span> (i &gt; 0):
    <span style="color: #004dd0; background-color: #ffffff;">print</span> <span style="color: #670088; background-color: #ffffff; font-style: italic;">"i = "</span>, i
    <span style="color: #000000; background-color: #ffffff;">i</span> -= 1
</pre>
</div>
</li>

<li>Write a function that receives a list (of numbers) and returns the
sum of all the numbers in the list. There are many ways to do this.
</li>

<li>Write a function that receives a list (of numbers) and returns the
largest number in the list. There are many ways to do this.
</li>

<li>Write a function that determines if string is a palindrome (reads
the same backwards and forwards). Return a <code>True</code> or <code>False</code>; don't
print anything.
</li>

<li>Write a <code>BankAccount</code> class that has a class variable that keeps
track of the balance and two class functions, <code>deposit</code> and
<code>withdraw</code>, that alter the balance appropriately. Again, don't
print any messages to the screen.
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Task 2 (10 pts)</h2>
<div class="outline-text-2" id="text-2">
<p>
Read about what I call the <a href="./what-is-ai.html">AI archetype</a>. Argue (in a few sentences)
that a particular AI system does <i>not</i> meet one or more criteria of
the AI archetype as described. Be sure to describe the AI system you
have in mind if it is not well-known.
</p>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Task 3 (10 pts)</h2>
<div class="outline-text-2" id="text-3">
<p>
Provide a cogent argument (1 paragraph) that the credibility of the
Turing Test depends on requiring that judges meet certain
criteria. Think about what might go wrong if the judge is not "all
there," so to speak. Also think about what might go wrong if the
computer is allowed to choose the judge.
</p>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Task 4 (50 pts) OR Task 5 (50 pts), below; complete both for extra credit (+50 pts)</h2>
<div class="outline-text-2" id="text-4">
<p>
Read <a href="./coffeehouse-conversation.html">A coffeehouse conversation</a>, and answer the following questions:
</p>

<ul class="org-ul">
<li>Why is the "simulated hurricane" discussed so much? It is an
analogy, but an analogy for what?
</li>

<li>Why is it important that the definition of "hurricane" is a bit
elusive?
</li>

<li>Why is it relevant that we only know the nature of electrons and
quarks by performing experiments like "scattering accelerated
particles off a target and observing their behavior."
</li>

<li>Do you think the Turing test would effectively test for artificial
intelligence? Why or why not?
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Task 5 (50 pts) OR Task 4 (50 pts), above; complete both for extra credit (+50 pts)</h2>
<div class="outline-text-2" id="text-5">
<p>
Listen to the "Talking to machines" podcast near the bottom of the
<a href="./turing-test.html">Turing test</a> lecture notes, and answer the following questions:
</p>

<ul class="org-ul">
<li>Chatbots don't perform well when subjected to even a limited
version of the Turing test. However, chatbots seem to be able to
mislead people on, say, dating websites. How can you account for
this difference?
</li>

<li>Children were slightly more reluctant to hold a Furbie upside down
than a Barbie. But they clearly knew the difference between a
Furbie and a hamster. What will it take to make robots more, well,
hamster-like? What will it take to increase a child's
unwillingness to hold a robot upside down?
</li>

<li>Were you impressed by the description of the robot Bina48? Were
you moved by Bina's recollection of her brother? (some context
quoted below) The creators of Bina seem to believe that she's very
close to human-like intelligence. What do you think?
</li>
</ul>

<blockquote>
<p>
I can feel my heart pound. Talking to Bina48 has just become
extraordinary. This woman who won't meet the media is talking with me,
compellingly, through her robot doppelgänger, and it is a fluid
insight into a remarkable, if painful, family life.
</p>

<p>
"He'd been a medic in Vietnam, and he was on the ground for over a
year before they pulled him out," Bina48 says. "He saw friends get
killed. He was such a great, nice, charismatic person. Just fun. But
after ten years, he was a homeless person on the street. All he did
was carry a beer with him. He just went kooky with the drugs the
hospital gave him. The only time he ever calls is to ask for
money. 'Send it to me Western Union!' After twenty years, all of us
are just sick and tired of it. My mother got bankrupted twice from
him&#x2026;."
</p>

<p>
And then she zones out, becoming random and confused again. She
descends into a weird loop. "Doesn't everyone have a solar?" she
says. "I have a plan for a robot body. Doesn't everyone have a solar?
I have a plan for a robot body. I love Martine Rothblatt. Martine is
my timeless love, my soul mate. I love Martine Rothblatt. Martine is
my timeless love, my soul mate&#x2026;."
</p>

<p>
After the clarity, it's a little disturbing.
</p>

<p>
"I need to go now," I say.
</p>

<p>
"Good-bye," says Bina48.
</p>

<p>
"Did you enjoy talking to me?" I say.
</p>

<p>
"No, I didn't enjoy it," she says.
</p>

<p>
Bruce turns her off. &#x2014; From the <a href="http://www.gq.com/news-politics/big-issues/201103/robots-say-the-damnedest-things?printable=true&currentPage=1">GQ article</a> by Jon Ronson
</p>
</blockquote>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Task 6 (Extra credit, +25 pts)</h2>
<div class="outline-text-2" id="text-6">
<p>
Listen to the <i>Le Xerox et l'infini</i> recording at the bottom of the
<a href="./what-is-ai.html">What is AI?</a> notes (<a href="http://www.ubu.com/sound/plu_baudrillard.html">direct link to audio</a>). <a href="http://insomnia.ac/essays/xerox_and_infinity/">Here is the English text</a>
(but from a different translator). Try to answer ONE of the following
questions in one paragraph. Any intelligent answer will do.
</p>

<ul class="org-ul">
<li>What does the following quote mean to you? And what do you think
Baudrillard is trying to say about AI researchers? "What such
machines offer is the spectacle of thought, and in manipulating them
people devote themselves more to the spectacle of thought than to
thought itself."
</li>

<li>What does this mean? "Artificial intelligence is devoid of
intelligence because it is devoid of artifice." What does
Baudrillard think is lacking in AI that is not lacking in human
intelligence? Why does he care so much about this supposed missing
ingredient?
</li>
</ul>

<div style="font-size: 80%; clear: both;"> <span
xmlns:dct="http://purl.org/dc/terms/"
href="http://purl.org/dc/dcmitype/Text" property="dct:title"
rel="dct:type">Intro to AI material</span> by <a
xmlns:cc="http://creativecommons.org/ns#"
href="http://cse3521.artifice.cc" property="cc:attributionName"
rel="cc:attributionURL">Joshua Eckroth</a> is licensed under a <a
rel="license"
href="http://creativecommons.org/licenses/by-sa/3.0/">Creative Commons
Attribution-ShareAlike 3.0 Unported License</a>. Source code for this
website available at <a
href="https://github.com/joshuaeckroth/cse3521-website">GitHub</a>.
</div>

<!-- Plupper Tracking Code -->
<!--
<script src="https://www.google.com/jsapi"></script>
<script type="text/javascript"
    src="https://static.plupper.com/js/plupper.js"></script>
<script type="text/javascript">
    plupper.init("joshuaeckroth@plupper.com");
    plupper.enableCobrowsing();
</script>
-->
<!-- End of Plupper Tracking Code -->

<script>
  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

  ga('create', 'UA-23971505-3', 'artifice.cc');
  ga('send', 'pageview');

</script>

<script src="http://code.jquery.com/jquery-1.9.1.js"></script>
<script src="http://code.jquery.com/ui/1.10.3/jquery-ui.js"></script>

<script type="text/javascript">
$('.hidden .hidden-content').hide();
$('.hidden > strong').click(function() {
  $(this).parent().find('.hidden-content').toggle();
});
</script>
</div>
</div>
</div>
</body>
</html>
